20241109T135333--kdoc-279-パイプのバッファはいっぱいになるとwriteをブロックする__permanent.org
:properties:
:ID: 20241109T135333
:mtime:    20241114212822
:ctime:    20241109135345
:end:
#+title:      KDOC 279: パイプのバッファはいっぱいになるとwriteをブロックする
#+date:       [2024-11-09 Sat 13:53]
#+filetags:   :permanent:
#+identifier: 20241109T135333

* この文書のステータス
- 作成
  - [X] 2024-11-09 貴島
- レビュー
  - [X] 2024-11-14 貴島

* 概要

パイプのバッファはいっぱいになるとwriteをブロックする。マニュアルの該当箇所を示す。

#+caption: 該当箇所
#+begin_src shell
man "pipe(7)" | grep -A 7 "Pipe capacity"
#+end_src

#+RESULTS:
#+begin_src
   Pipe capacity
       A  pipe  has  a limited capacity.  If the pipe is full, then a write(2)
       will block or fail, depending on whether the  O_NONBLOCK  flag  is  set
       (see  below).   Different implementations have different limits for the
       pipe capacity.  Applications should not rely on a particular  capacity:
       an  application  should  be designed so that a reading process consumes
       data as soon as it is available, so that a writing process does not re‐
       main blocked.
#+end_src

* 関連
- [[id:20241109T134521][KDOC 278: パイプの詰まりを再現する]]。マニュアルの通りか挙動を確かめた
