20241109T135333--kdoc-279-パイプのバッファはいっぱいになるとwriteをブロックする__permanent.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-11-05T19:13:22Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 279: パイプのバッファはいっぱいになるとwriteをブロックする</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 279: パイプのバッファはいっぱいになるとwriteをブロックする</h1>
<div id="outline-container-org0bb991a" class="outline-2">
<h2 id="org0bb991a"><a href="#org0bb991a">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org0bb991a">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-09 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2024-11-14 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org161ed55" class="outline-2">
<h2 id="org161ed55"><a href="#org161ed55">概要</a></h2>
<div class="outline-text-2" id="text-org161ed55">
<p>
パイプのバッファはいっぱいになるとwriteをブロックする。マニュアルの該当箇所を示す。
</p>

<div class="org-src-container">
<label class="org-src-name"><span class="listing-number">Listing 1: </span>該当箇所</label><pre class="src src-shell">man <span class="org-string">"pipe(7)"</span> | grep -A 7 <span class="org-string">"Pipe capacity"</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-nil">Pipe capacity
    A  pipe  has  a limited capacity.  If the pipe is full, then a write(2)
    will block or fail, depending on whether the  O_NONBLOCK  flag  is  set
    (see  below).   Different implementations have different limits for the
    pipe capacity.  Applications should not rely on a particular  capacity:
    an  application  should  be designed so that a reading process consumes
    data as soon as it is available, so that a writing process does not re‐
    main blocked.
</pre>
</div>
</div>
</div>
<div id="outline-container-org56b74c9" class="outline-2">
<h2 id="org56b74c9"><a href="#org56b74c9">関連</a></h2>
<div class="outline-text-2" id="text-org56b74c9">
<ul class="org-ul">
<li><a href="20241109T134521--kdoc-278-パイプの詰まりを再現する__permanent.html#ID-20241109T134521">KDOC 278: パイプの詰まりを再現する</a>。マニュアルの通りか挙動を確かめた</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
